# Use ATM_Payments_Distribution Notebook Template

In [8]:
from fosforio import snowflake

In [6]:
# To get snowflake connection object with a default snowflake connection created by the user, if available.
snowflake.get_connection()

# To get snowflake connection object with a specific connection name
#snowflake.get_connection(connection_name="FDC_SNOWFLAKE")

User name picked from OS env: manishh.singh@fosfor.com
Fetching connections created by manishh.singh@fosfor.com user
Connection names fetched ['FDC_SNOWFLAKE', 'FDC_SNOWFLAKE', 'FDC_SNOWFLAKE', 'FDC_SNOWFLAKE'], created by manishh.singh@fosfor.com
Exception occurred in getting snowflake connection: 'connectionSources'

# ATM Meta data

In [12]:
# To read a specific dataset published from a snowflake connection
df_atm = snowflake.get_dataframe("ATM_METADATA")

In [13]:
df_atm.shape

(420, 6)

In [14]:
df_atm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420 entries, 0 to 419
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ATM_ID        420 non-null    object
 1   MAX_CAPACITY  420 non-null    float64
 2   BANK_ID       420 non-null    int8
 3   STATE         420 non-null    object
 4   CREATED_BY    420 non-null    object
 5   CREATED_AT    420 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int8(1), object(3)
memory usage: 16.9+ KB

In [15]:
df_atm.describe()

       MAX_CAPACITY    BANK_ID           CREATED_AT
count  4.200000e+02  420.00000                  420
mean   3.300000e+06    2.00000  2024-05-14 07:43:27
min    2.420000e+06    1.00000  2024-05-14 07:43:27
25%    2.860000e+06    1.00000  2024-05-14 07:43:27
50%    3.520000e+06    2.00000  2024-05-14 07:43:27
75%    3.520000e+06    3.00000  2024-05-14 07:43:27
max    3.740000e+06    3.00000  2024-05-14 07:43:27
std    3.845215e+05    0.81747                  NaN

In [16]:
df_atm.head()

,ATM_ID,MAX_CAPACITY,BANK_ID,STATE,CREATED_BY,CREATED_AT
0,SPCN2020,2640000.0,1,Michigan,manishh.singh@fosfor.com,2024-05-14 07:43:27
1,TBH00000303920,3520000.0,3,Minnesota,manishh.singh@fosfor.com,2024-05-14 07:43:27
2,TBH00000303919,3520000.0,3,Hawaii,manishh.singh@fosfor.com,2024-05-14 07:43:27
3,TBH00000303918,3520000.0,3,Utah,manishh.singh@fosfor.com,2024-05-14 07:43:27
4,TBH00000303917,3520000.0,3,Oregon,manishh.singh@fosfor.com,2024-05-14 07:43:27

In [18]:
df_atm.isnull().sum()

ATM_ID          0
MAX_CAPACITY    0
BANK_ID         0
STATE           0
CREATED_BY      0
CREATED_AT      0
dtype: int64

In [21]:
cols = ['ATM_ID','STATE']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_atm[col].nunique())

------------------------------------------------
ATM_ID  ->  420
------------------------------------------------
STATE  ->  50

# BANKS Meta data

In [22]:
# To read a specific dataset published from a snowflake connection
df_bank = snowflake.get_dataframe("ATM_BANK_METADATA")

In [23]:
df_bank.shape

(3, 4)

In [24]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   BANK_ID     3 non-null      int8
 1   BANK_NAME   3 non-null      object
 2   CREATED_BY  3 non-null      object
 3   CREATED_AT  3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int8(1), object(2)
memory usage: 203.0+ bytes

In [25]:
df_bank.describe()

       BANK_ID           CREATED_AT
count      3.0                    3
mean       2.0  2024-05-14 07:47:20
min        1.0  2024-05-14 07:47:20
25%        1.5  2024-05-14 07:47:20
50%        2.0  2024-05-14 07:47:20
75%        2.5  2024-05-14 07:47:20
max        3.0  2024-05-14 07:47:20
std        1.0                  NaN

In [26]:
df_bank.head()

   BANK_ID    BANK_NAME                CREATED_BY          CREATED_AT
0        1  Wells Fargo  manishh.singh@fosfor.com 2024-05-14 07:47:20
1        2   BNY Mellon  manishh.singh@fosfor.com 2024-05-14 07:47:20
2        3     Citibank  manishh.singh@fosfor.com 2024-05-14 07:47:20

In [27]:
df_bank.isnull().sum()

BANK_ID       0
BANK_NAME     0
CREATED_BY    0
CREATED_AT    0
dtype: int64

In [28]:
cols = ['BANK_NAME']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_bank[col].nunique())

------------------------------------------------
BANK_NAME  ->  3

In [29]:
# DATE Metadata

In [30]:
# To read a specific dataset published from a snowflake connection
df_date = snowflake.get_dataframe("ATM_DATE_METADATA")

In [31]:
df_date.shape

(783, 5)

In [32]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 783 entries, 0 to 782
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   DATE        783 non-null    object
 1   WEEKDAY     783 non-null    object
 2   HOLIDAY     783 non-null    bool
 3   CREATED_BY  783 non-null    object
 4   CREATED_AT  783 non-null    datetime64[ns]
dtypes: bool(1), datetime64[ns](1), object(3)
memory usage: 25.4+ KB

In [33]:
df_date.describe()

                          CREATED_AT
count                            783
mean   2024-05-14 07:43:32.999999488
min              2024-05-14 07:43:33
25%              2024-05-14 07:43:33
50%              2024-05-14 07:43:33
75%              2024-05-14 07:43:33
max              2024-05-14 07:43:33

In [34]:
df_date.head()

         DATE  WEEKDAY  HOLIDAY                CREATED_BY          CREATED_AT
0  2021-01-01  weekend     True  manishh.singh@fosfor.com 2024-05-14 07:43:33
1  2023-02-22  weekday    False  manishh.singh@fosfor.com 2024-05-14 07:43:33
2  2023-02-21  weekday    False  manishh.singh@fosfor.com 2024-05-14 07:43:33
3  2023-02-20  weekday     True  manishh.singh@fosfor.com 2024-05-14 07:43:33
4  2023-02-19  weekday    False  manishh.singh@fosfor.com 2024-05-14 07:43:33

In [35]:
df_date.isnull().sum()

DATE          0
WEEKDAY       0
HOLIDAY       0
CREATED_BY    0
CREATED_AT    0
dtype: int64

In [36]:
cols = ['DATE','WEEKDAY','HOLIDAY']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_date[col].nunique())

------------------------------------------------
DATE  ->  783
------------------------------------------------
WEEKDAY  ->  2
------------------------------------------------
HOLIDAY  ->  2

# TRANSACTION METADATA

In [37]:
# To read a specific dataset published from a snowflake connection
df_trans = snowflake.get_dataframe("ATM_TRANSACTION_METADATA")

In [38]:
df_trans.shape

(328860, 7)

In [39]:
df_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 328860 entries, 0 to 328859
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   ATMID          328860 non-null  object
 1   DATE           328860 non-null  object
 2   DISPENSE       328860 non-null  float64
 3   DT             328860 non-null  float64
 4   COUNTTOTALTXN  328860 non-null  float64
 5   CREATED_BY     328860 non-null  object
 6   CREATED_AT     328860 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(3)
memory usage: 17.6+ MB

In [40]:
df_trans.describe()

,DISPENSE,DT,COUNTTOTALTXN,CREATED_AT
count,3.288600e+05,328860.000000,328860.000000,328860
mean,3.217324e+05,126.453506,83.735632,2024-05-14 07:43:40.000001280
min,0.000000e+00,0.000000,0.000000,2024-05-14 07:43:40
25%,7.227000e+04,0.000000,22.000000,2024-05-14 07:43:40
50%,2.866500e+05,0.000000,78.000000,2024-05-14 07:43:40
75%,4.904100e+05,37.000000,124.000000,2024-05-14 07:43:40
max,1.936620e+06,1296.000000,504.000000,2024-05-14 07:43:40
std,2.818005e+05,305.196984,71.546692,NaN

In [41]:
df_trans.head()

,ATMID,DATE,DISPENSE,DT,COUNTTOTALTXN,CREATED_BY,CREATED_AT
0,TBH000274025,2023-01-29,225180.0,0.0,90.0,manishh.singh@fosfor.com,2024-05-14 07:43:40
1,TBH000274025,2023-01-30,262440.0,0.0,117.0,manishh.singh@fosfor.com,2024-05-14 07:43:40
2,TBH000274025,2023-01-31,561150.0,0.0,160.0,manishh.singh@fosfor.com,2024-05-14 07:43:40
3,TBH000274025,2023-02-01,437220.0,0.0,129.0,manishh.singh@fosfor.com,2024-05-14 07:43:40
4,TBH000274025,2023-02-02,360900.0,0.0,119.0,manishh.singh@fosfor.com,2024-05-14 07:43:40

In [42]:
df_trans.isnull().sum()

ATMID            0
DATE             0
DISPENSE         0
DT               0
COUNTTOTALTXN    0
CREATED_BY       0
CREATED_AT       0
dtype: int64

In [44]:
cols = ['ATMID','DATE','DISPENSE','DT','COUNTTOTALTXN']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_trans[col].nunique())

------------------------------------------------
ATMID  ->  420
------------------------------------------------
DATE  ->  783
------------------------------------------------
DISPENSE  ->  5497
------------------------------------------------
DT  ->  1022
------------------------------------------------
COUNTTOTALTXN  ->  381